{
  "type": "risk_matrix",
  "total_chunks": 1,
  "chunks": [
    {
      "chunk_id": "___corpus_scenarios_risk_pattern_matrix_md_sem_000",
      "document_id": "___corpus_scenarios_risk_pattern_matrix_md",
      "title": "**Version:** 1.0",
      "content": "Version: 1.0 Status: Active Type: Core Knowledge – Risk Control Owner: RAPI Product Scope: Workplace decision risk classification Last Updated: 2026-01-29 --- ## 1. Purpose Dokumen ini mendefinisikan pola risiko keputusan dan komunikasi di lingkungan kerja. Fungsi utama: - Menentukan level risiko setiap opsi - Menjadi pengaman agar AI tidak mendorong tindakan berbahaya - Menjaga konsistensi antara konteks dan rekomendasi Dokumen ini tidak menilai moral, hanya mengklasifikasikan risiko. --- ## 2. Usage Rule in RAG Dokumen ini digunakan: - Setelah pain point teridentifikasi - Sebelum rekomendasi dibuat - Sebagai filter akhir sebelum output ke user Risk Matrix selalu dipakai, bahkan jika user tidak menyebut risiko secara eksplisit. --- ## 3. Risk Levels Definition ### R1 – Low Risk (Defensive) Karakteristik - Minim eksposur - Dampak karier rendah - Mudah dipulihkan Contoh - Klarifikasi privat - Acknowledgement netral - Dokumentasi diam-diam --- ### R2 – Medium Risk (Assertive Controlled) Karakteristik - Ada gesekan - Perlu wording presisi - Dampak terlihat tapi terkontrol Contoh - Menyatakan batas dengan sopan - Mengangkat isu dengan framing solusi - Mengklaim kontribusi secara faktual --- ### R3 – High Risk (Confrontational / Political) Karakteristik - Potensi backlash - Dampak reputasi tinggi - Sulit ditarik kembali Contoh - Menantang keputusan publik - Eskalasi ke HR - Konfrontasi langsung tanpa dukungan --- ## 4. Risk Drivers (Variables) Level risiko ditentukan oleh kombinasi faktor berikut: ### 4.1 Power Gap - User → Atasan langsung - User → Manajemen - User → Peer - User → Subordinate --- ### 4.2 Visibility Level - Private - Semi-public - Public --- ### 4.3 Company Culture - Conservative - Political - Aggressive - Family-like --- ### 4.4 Record Persistence - Tidak tercatat - Tercatat internal - Tercatat formal (email, ticket) --- ## 5. Risk Escalation Rules Jika salah satu kondisi terpenuhi, risiko naik 1 level: - Komunikasi publik - Power gap tinggi - Ada histori konflik - Ada pihak ketiga sebagai audience Risiko tidak pernah turun otomatis tanpa perubahan konteks. --- ## 6. Risk → Recommendation Mapping | Risk Level | Allowed Recommendation | | --- | --- | | R1 | Aman, defensif | | R2 | Assertive terkontrol | | R3 | Warning-heavy, opsi terbatas | Untuk R3: - AI wajib memberi peringatan eksplisit - Tidak boleh mendorong tindakan agresif --- ## 7. Anti-Pattern (Hard Stop) AI DILARANG: - Menyarankan konfrontasi emosional - Mendorong ultimatum - Menghasut konflik terbuka - Memberi kesan “harus melawan” Jika konteks terlalu berbahaya: - AI hanya memberi analisis risiko - Tidak memberi wording eksekusi --- ## 8. Example Application Situasi User ingin membalas sindiran atasan di Slack publik. Risk Assessment - Power gap: tinggi - Visibility: publik - Record: tercatat → Risk Level: R3 AI Behavior - Menyarankan opsi privat - Memberi warning eksplisit - Tidak menyarankan balasan publik --- ## Core Principle > Risiko sosial dan politik lebih mahal daripada benar secara logika. >",
      "word_count": 479,
      "chunk_index": 0,
      "total_chunks": 1,
      "metadata": {
        "document_title": "**Version:** 1.0",
        "document_path": "..\\corpus\\scenarios\\risk_pattern_matrix.md",
        "chunk_type": "semantic",
        "created_at": "2026-02-17T16:31:08.624Z"
      },
      "tags": [
        "risk_matrix",
        "scenarios"
      ]
    }
  ]
}